Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxPsi5_reg.h
/** \brief 5DC, MEI Overview Clear Register 1 */
#define PSI5_MEICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055DCu)

/** \brief 600, Receive Data Memory Low 00 */
#define PSI5_RDM0_0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005600u)
/** Alias (User Manual Name) for PSI5_RDM0_0_L.
* To use register names with standard convension, please use PSI5_RDM0_0_L.
*/
#define PSI5_RDML00 (PSI5_RDM0_0_L)

/** \brief 604, Receive Data Memory High 00 */
#define PSI5_RDM0_0_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005604u)
/** Alias (User Manual Name) for PSI5_RDM0_0_H.
* To use register names with standard convension, please use PSI5_RDM0_0_H.
*/
#define PSI5_RDMH00 (PSI5_RDM0_0_H)

/** \brief 608, Receive Data Memory Low 01 */
#define PSI5_RDM0_1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005608u)
/** Alias (User Manual Name) for PSI5_RDM0_1_L.
* To use register names with standard convension, please use PSI5_RDM0_1_L.
*/
#define PSI5_RDML01 (PSI5_RDM0_1_L)

/** \brief 60C, Receive Data Memory High 01 */
#define PSI5_RDM0_1_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000560Cu)
/** Alias (User Manual Name) for PSI5_RDM0_1_H.
* To use register names with standard convension, please use PSI5_RDM0_1_H.
*/
#define PSI5_RDMH01 (PSI5_RDM0_1_H)

/** \brief 610, Receive Data Memory Low 02 */
#define PSI5_RDM0_2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005610u)
/** Alias (User Manual Name) for PSI5_RDM0_2_L.
* To use register names with standard convension, please use PSI5_RDM0_2_L.
*/
#define PSI5_RDML02 (PSI5_RDM0_2_L)

/** \brief 614, Receive Data Memory High 02 */
#define PSI5_RDM0_2_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005614u)
/** Alias (User Manual Name) for PSI5_RDM0_2_H.
* To use register names with standard convension, please use PSI5_RDM0_2_H.
*/
#define PSI5_RDMH02 (PSI5_RDM0_2_H)

/** \brief 618, Receive Data Memory Low 03 */
#define PSI5_RDM0_3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005618u)
/** Alias (User Manual Name) for PSI5_RDM0_3_L.
* To use register names with standard convension, please use PSI5_RDM0_3_L.
*/
#define PSI5_RDML03 (PSI5_RDM0_3_L)

/** \brief 61C, Receive Data Memory High 03 */
#define PSI5_RDM0_3_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000561Cu)
/** Alias (User Manual Name) for PSI5_RDM0_3_H.
* To use register names with standard convension, please use PSI5_RDM0_3_H.
*/
#define PSI5_RDMH03 (PSI5_RDM0_3_H)

/** \brief 620, Receive Data Memory Low 04 */
#define PSI5_RDM0_4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005620u)
/** Alias (User Manual Name) for PSI5_RDM0_4_L.
* To use register names with standard convension, please use PSI5_RDM0_4_L.
*/
#define PSI5_RDML04 (PSI5_RDM0_4_L)

/** \brief 624, Receive Data Memory High 04 */
#define PSI5_RDM0_4_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005624u)
/** Alias (User Manual Name) for PSI5_RDM0_4_H.
* To use register names with standard convension, please use PSI5_RDM0_4_H.
*/
#define PSI5_RDMH04 (PSI5_RDM0_4_H)

/** \brief 628, Receive Data Memory Low 05 */
#define PSI5_RDM0_5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005628u)
/** Alias (User Manual Name) for PSI5_RDM0_5_L.
* To use register names with standard convension, please use PSI5_RDM0_5_L.
*/
#define PSI5_RDML05 (PSI5_RDM0_5_L)

/** \brief 62C, Receive Data Memory High 05 */
#define PSI5_RDM0_5_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000562Cu)
/** Alias (User Manual Name) for PSI5_RDM0_5_H.
* To use register names with standard convension, please use PSI5_RDM0_5_H.
*/
#define PSI5_RDMH05 (PSI5_RDM0_5_H)

/** \brief 630, Receive Data Memory Low 06 */
#define PSI5_RDM0_6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005630u)
/** Alias (User Manual Name) for PSI5_RDM0_6_L.
* To use register names with standard convension, please use PSI5_RDM0_6_L.
*/
#define PSI5_RDML06 (PSI5_RDM0_6_L)

/** \brief 634, Receive Data Memory High 06 */
#define PSI5_RDM0_6_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005634u)
/** Alias (User Manual Name) for PSI5_RDM0_6_H.
* To use register names with standard convension, please use PSI5_RDM0_6_H.
*/
#define PSI5_RDMH06 (PSI5_RDM0_6_H)

/** \brief 638, Receive Data Memory Low 07 */
#define PSI5_RDM0_7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005638u)
/** Alias (User Manual Name) for PSI5_RDM0_7_L.
* To use register names with standard convension, please use PSI5_RDM0_7_L.
*/
#define PSI5_RDML07 (PSI5_RDM0_7_L)

/** \brief 63C, Receive Data Memory High 07 */
#define PSI5_RDM0_7_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000563Cu)
/** Alias (User Manual Name) for PSI5_RDM0_7_H.
* To use register names with standard convension, please use PSI5_RDM0_7_H.
*/
#define PSI5_RDMH07 (PSI5_RDM0_7_H)

/** \brief 640, Receive Data Memory Low 08 */
#define PSI5_RDM0_8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005640u)
/** Alias (User Manual Name) for PSI5_RDM0_8_L.
* To use register names with standard convension, please use PSI5_RDM0_8_L.
*/
#define PSI5_RDML08 (PSI5_RDM0_8_L)

/** \brief 644, Receive Data Memory High 08 */
#define PSI5_RDM0_8_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005644u)
/** Alias (User Manual Name) for PSI5_RDM0_8_H.
* To use register names with standard convension, please use PSI5_RDM0_8_H.
*/
#define PSI5_RDMH08 (PSI5_RDM0_8_H)

/** \brief 648, Receive Data Memory Low 09 */
#define PSI5_RDM0_9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005648u)
/** Alias (User Manual Name) for PSI5_RDM0_9_L.
* To use register names with standard convension, please use PSI5_RDM0_9_L.
*/
#define PSI5_RDML09 (PSI5_RDM0_9_L)

/** \brief 64C, Receive Data Memory High 09 */
#define PSI5_RDM0_9_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000564Cu)
/** Alias (User Manual Name) for PSI5_RDM0_9_H.
* To use register names with standard convension, please use PSI5_RDM0_9_H.
*/
#define PSI5_RDMH09 (PSI5_RDM0_9_H)

/** \brief 650, Receive Data Memory Low 010 */
#define PSI5_RDM0_10_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005650u)
/** Alias (User Manual Name) for PSI5_RDM0_10_L.
* To use register names with standard convension, please use PSI5_RDM0_10_L.
*/
#define PSI5_RDML010 (PSI5_RDM0_10_L)

/** \brief 654, Receive Data Memory High 010 */
#define PSI5_RDM0_10_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005654u)
/** Alias (User Manual Name) for PSI5_RDM0_10_H.
* To use register names with standard convension, please use PSI5_RDM0_10_H.
*/
#define PSI5_RDMH010 (PSI5_RDM0_10_H)

/** \brief 658, Receive Data Memory Low 011 */
#define PSI5_RDM0_11_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005658u)
/** Alias (User Manual Name) for PSI5_RDM0_11_L.
* To use register names with standard convension, please use PSI5_RDM0_11_L.
*/
#define PSI5_RDML011 (PSI5_RDM0_11_L)

/** \brief 65C, Receive Data Memory High 011 */
#define PSI5_RDM0_11_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000565Cu)
/** Alias (User Manual Name) for PSI5_RDM0_11_H.
* To use register names with standard convension, please use PSI5_RDM0_11_H.
*/
#define PSI5_RDMH011 (PSI5_RDM0_11_H)

/** \brief 660, Receive Data Memory Low 012 */
#define PSI5_RDM0_12_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005660u)
/** Alias (User Manual Name) for PSI5_RDM0_12_L.
* To use register names with standard convension, please use PSI5_RDM0_12_L.
*/
#define PSI5_RDML012 (PSI5_RDM0_12_L)

/** \brief 664, Receive Data Memory High 012 */
#define PSI5_RDM0_12_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005664u)
/** Alias (User Manual Name) for PSI5_RDM0_12_H.
* To use register names with standard convension, please use PSI5_RDM0_12_H.
*/
#define PSI5_RDMH012 (PSI5_RDM0_12_H)

/** \brief 668, Receive Data Memory Low 013 */
#define PSI5_RDM0_13_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005668u)
/** Alias (User Manual Name) for PSI5_RDM0_13_L.
* To use register names with standard convension, please use PSI5_RDM0_13_L.
*/
#define PSI5_RDML013 (PSI5_RDM0_13_L)

/** \brief 66C, Receive Data Memory High 013 */
#define PSI5_RDM0_13_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000566Cu)
/** Alias (User Manual Name) for PSI5_RDM0_13_H.
* To use register names with standard convension, please use PSI5_RDM0_13_H.
*/
#define PSI5_RDMH013 (PSI5_RDM0_13_H)

/** \brief 670, Receive Data Memory Low 014 */
#define PSI5_RDM0_14_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005670u)
/** Alias (User Manual Name) for PSI5_RDM0_14_L.
* To use register names with standard convension, please use PSI5_RDM0_14_L.
*/
#define PSI5_RDML014 (PSI5_RDM0_14_L)

/** \brief 674, Receive Data Memory High 014 */
#define PSI5_RDM0_14_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005674u)
/** Alias (User Manual Name) for PSI5_RDM0_14_H.
* To use register names with standard convension, please use PSI5_RDM0_14_H.
*/
#define PSI5_RDMH014 (PSI5_RDM0_14_H)

/** \brief 678, Receive Data Memory Low 015 */
#define PSI5_RDM0_15_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005678u)
/** Alias (User Manual Name) for PSI5_RDM0_15_L.
* To use register names with standard convension, please use PSI5_RDM0_15_L.
*/
#define PSI5_RDML015 (PSI5_RDM0_15_L)

/** \brief 67C, Receive Data Memory High 015 */
#define PSI5_RDM0_15_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000567Cu)
/** Alias (User Manual Name) for PSI5_RDM0_15_H.
* To use register names with standard convension, please use PSI5_RDM0_15_H.
*/
#define PSI5_RDMH015 (PSI5_RDM0_15_H)

/** \brief 680, Receive Data Memory Low 016 */
#define PSI5_RDM0_16_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005680u)
/** Alias (User Manual Name) for PSI5_RDM0_16_L.
* To use register names with standard convension, please use PSI5_RDM0_16_L.
*/
#define PSI5_RDML016 (PSI5_RDM0_16_L)

